{
    "sections":{
        "applicationHome":{
            "helpTips":{"appDescription":"Click to edit the application's description","productionUrlViewOnly":"This URL will be assigned to a branch once it is promoted to production.","productionUrl":"Edit the application’s subdomain to complete the production URL.","appIcon":"Click on the icon to change it","launch":"Click the buttons associated with each application version to deploy and launch it","teamAndResources":"Shown below is the summary of team members and resources allocated to this application"}
        },
        "team":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":"The team members participating in the current application are listed here."} },
            "helpTips":{"listMemberHelp":"To delete an existing member/s, select the member/s first and then click the delete icon."}
        },
        "repoAndBuild":{
            "description":{"roles":"appowner,developer", "details":{ "msg":"", "subMsg":"You see the development status of the current application here. You can <ul><li>Create new versions (branches)</li><li>Edit the code</li><li>Build and deploy branches</li><li>Set automated build and deploy</li><li>Launch and test branches</li>" } },
            "helpTips":{"reposAndBuildHelp":"In order to view the build and repository details of an application version - please select the required stage and the version from the drop down below. You will need to create a fork to create your own repository of the selected application version if not already done.","masterRepoHelp":"Shown below are the details of the master repo of the application version selected above.","forkedRepoHelp":"Shown below are the details of your repository of the application version selected above."}
        },
        "lifecycle":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":"Using this page, you can manage the lifecycles of all versions of your application. Versions that are not built and deployed are not displayed here."} },
            "estimatedDate":{"roles":"appowner,developer", "details":{ "msg":"", "subMsg":"You can also set the estimated date of completion for each stage. The mean of the dates set by the team would be displayed in the application overview page."} }
        },
        "issues":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":"This page shows all the issues created for the current application."} }
        },
        "userhome":{
            "generalWelcome":{"roles":"appowner,developer,qa,devops,cxo", "details":{"msg":"", "subMsg":"Welcome to WSO2 App Cloud! <p> This page shows you all applications you can participate in."} },
            "createApplication":{"roles":"appowner", "details":{"msg":"", "subMsg":"To create an application, click the <b>Add New Application</b> button."} }
        },
        "memberAddition":{
            "addMember":{"roles":"appowner", "details":{ "msg":"", "subMsg":"You can type in the member name in the box below to add to the list. To get access, the member accounts need to already exist in the organization. </p>To add new members to the organization to change roles of existing members, please go to the <a href=www.google.lk> organisation page</a> instead.", } },
            "helpTips":{"addMemberHelp":"Enter the member's user name."}
        },
        "resourcesOverview":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":"<p> Use a single name within your application to refer to a resource whose value will change from stage to stage.<p> Code snippets are given in each section to be used in the application. Read more <a href=https://docs.wso2.org/display/AF200/WSO2+App+Factory+Documentation target=_blank>here<a>."} },
            "helpTips":{"datasourceHelp":"Datasources created for this application are listed below.","apiHelp":"APIs created for this application are listed below.","propertyHelp":"Property resources created for this application are listed below","userRealmHelp":"Selecting this option enables this application to use user realm services from within the application","noDatasources":"Datasources have not been created yet.","noAPIs":"No APIs have been subscribed to yet.","noProperties":"Property resources have not been created yet."}
        },
        "resources-databases":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":"Create/update and delete datasources, databases, database users and permission templates."} },
            "helpTips":{"datasourceHelp":"Listed below are the datasources that were created for the databases used within this application","databaseHelp":"Listed below are the databases that were created for this application","databaseUserHelp":"Database users created here can be used with existing databases or new ones created for this application.","permissionTemplateHelp":"Permission templates can be created only by members who have permission to access all the stages.<br> Templates created here can be used with existing databases or new ones created for this application."}
        },
        "databases": {
            "description": {"roles": "appowner,developer,qa,devops,cxo", "details": {"msg": "", "subMsg": "Create/update and delete MySQL databases, database users and permission templates."} }
        },
        "add-databases":{
            "helpTips":{"createInAllEnvsHelp":"Select this option to create this database in all environments of the application"}
        },
        "resources-datasources":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":" This datasource uses a unique name but is registered with different connection details across different stages of the application lifecycle."} },
            "helpTips":{"datasourceHelp":"Shown below are the datasource that were created for the databases within this application space"}
        },
        "resources-apis":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":" Applications can use APIs. Enterprise APIs are the APIs hosted in the App Cloud in your tenant store.<p> External APIs are any other APIs that can be accessed with or without authentication.<p>Authentication can be either OAuth, Tokens and BasicAuth."} },
            "helpTips":{"apiHelp":"APIs created for this application are listed below. These APIs are not managed.","enterpriseApiHelp":"APIs created for this application are listed below. These APIs are managed by the API Cloud."}
        },
        "add-extapis":{
            "helpTips":{"createInAllEnvsHelp":"Select this option to create this external api reference in all environments of the application","authenticationHelp":"Select the authentication method relevant to the external api defined from the drop down above and fill in the authentication details as prompted."}
        },
        "resources-properties":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":" Name value pairs can be used in your application. The value can differ from stage to stage but your application can use the same name.."} },
            "helpTips":{"propertyHelp":"Properties created for this application are listed below."}
        },
        "add-properties":{
            "helpTips":{"createInAllEnvsHelp":"Select this option to create the property in all environments of the application"}
        },
        "server":{
            "description":{"roles":"appowner,developer,qa,devops,cxo", "details":{ "msg":"", "subMsg":"Using this page, you can download server logs."} },
            "helpTips":{"selectHelpTip":"Select a version of the application and its environment to download server logs","downloadHelpTip":"Logs of deployed applications are archived daily. Specify a date to download archived logs.<br> To view logs that are not archived yet, click the <b>View</b> button."}
        },
        "addApplication":{
            "generalWelcome":{"roles":"appowner", "details":{"msg":"", "subMsg":"Upload an existing application or create one from scratch, which creates a skeleton application based on the app type you select."} },
            "helpTips":{"appKey":"A unique key across all applications. This key is used in places like creating repositories and continuous build systems for your apps. <br> If required you can edit it to a key of your preference","appIcon":"The maximum file size is 5MB. <br> Accepted file types are jpg, jpeg, gif, bmp and png","appType":"Select the type of application you want to create. <br> Accepted file types are war and zip","repoType":"Select a version control system","appUpload":"Select the type of application to upload","appCreateMethod":"Upload an existing application or create one from scratch, which creates a skeleton application based on the app type you select."}
        }
    }
}

